In [32]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta
date_today = datetime.now()
date_last = datetime.now()- timedelta(days=365)
print(date_today)
days = pd.date_range(date_last, date_today, freq='D')

np.random.seed(seed=1111)
data = np.random.randint(1, high=100, size=len(days))
df = pd.DataFrame({'Days': days, 'Index': data})
print(df.head(20))
print(df.count())

2019-12-26 15:39:13.101684
                         Days  Index
0  2018-12-26 15:39:13.101684     29
1  2018-12-27 15:39:13.101684     56
2  2018-12-28 15:39:13.101684     82
3  2018-12-29 15:39:13.101684     13
4  2018-12-30 15:39:13.101684     35
5  2018-12-31 15:39:13.101684     53
6  2019-01-01 15:39:13.101684     25
7  2019-01-02 15:39:13.101684     23
8  2019-01-03 15:39:13.101684     21
9  2019-01-04 15:39:13.101684     12
10 2019-01-05 15:39:13.101684     15
11 2019-01-06 15:39:13.101684      9
12 2019-01-07 15:39:13.101684     13
13 2019-01-08 15:39:13.101684     87
14 2019-01-09 15:39:13.101684      9
15 2019-01-10 15:39:13.101684     63
16 2019-01-11 15:39:13.101684     62
17 2019-01-12 15:39:13.101684     52
18 2019-01-13 15:39:13.101684     43
19 2019-01-14 15:39:13.101684     77
Days     366
Index    366
dtype: int64

In [36]:
df=pd.DataFrame({'height': [23,42,55] ,'weight': [71,32,48]} )

In [37]:
print(df)

   height  weight
0      23      71
1      42      32
2      55      48

In [51]:
ser1=pd.Series([2,3,4,5])
ser2=pd.Series([5,6,7,8])
result=ser1.isin(ser2)

In [47]:
print(result)

0    False
1    False
2    False
3     True
dtype: bool

In [52]:
res=ser1.drop(ser2.index[0:3])

In [53]:
print(res)

3    5
dtype: int64

In [54]:
titanic=pd.read_csv("../titanic.csv")
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [55]:
titanic.median()

PassengerId    446.0000
Survived         0.0000
Pclass           3.0000
Age             28.0000
SibSp            0.0000
Parch            0.0000
Fare            14.4542
dtype: float64

In [57]:
titanic['Age'].max()

80.0

In [59]:
titanic.quantile(0.5)

PassengerId    446.0000
Survived         0.0000
Pclass           3.0000
Age             28.0000
SibSp            0.0000
Parch            0.0000
Fare            14.4542
Name: 0.5, dtype: float64

In [60]:
titanic.quantile(0.25)

PassengerId    223.5000
Survived         0.0000
Pclass           2.0000
Age             20.1250
SibSp            0.0000
Parch            0.0000
Fare             7.9104
Name: 0.25, dtype: float64

In [61]:
titanic.quantile(0.75)

PassengerId    668.5
Survived         1.0
Pclass           3.0
Age             38.0
SibSp            1.0
Parch            0.0
Fare            31.0
Name: 0.75, dtype: float64

In [62]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [63]:
titanic['SibSp'].value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [65]:
titanic['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [81]:
titanic['bins']=pd.cut(titanic['Fare'],[0,10,20,40,80,300])

In [73]:
titanic['Fare'].max()

512.3292

In [82]:
titanic['bins'].value_counts()

(0, 10]      321
(20, 40]     200
(10, 20]     179
(40, 80]     102
(80, 300]     71
Name: bins, dtype: int64

In [84]:
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
bins            18
dtype: int64

In [87]:
titanic['Age'].value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
         ..
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: Age, Length: 88, dtype: int64

In [89]:
titanic.nlargest(5, ['Age'])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,bins
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S,"(20, 40]"
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S,"(0, 10]"
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C,"(20, 40]"
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C,"(40, 80]"
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q,"(0, 10]"

In [95]:
ser1=pd.Series([10,9,6,5,3,1,12,8,13])
ser2=pd.Series([1,3,10,13])
ser1.isin(ser2)

0     True
1    False
2    False
3    False
4     True
5     True
6    False
7    False
8     True
dtype: bool

In [7]:
import pandas as pd
import numpy as np
dates=pd.Series(['01 Jan 2010','02-02-2011','20120303','2013/04/04','2014-05-05','2015-06-06T12:20'])
print(dates)

0         01 Jan 2010
1          02-02-2011
2            20120303
3          2013/04/04
4          2014-05-05
5    2015-06-06T12:20
dtype: object

In [10]:
dat=pd.to_datetime(dates)

In [11]:
dat

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

In [23]:
for d in dat:
    print("day of month",pd.to_datetime(d).day)
    print("week number",pd.to_datetime(d).week)
    print("day of year",pd.to_datetime(d).dayofyear)
    print("day of week",pd.to_datetime(d).dayofweek)

day of month 1
week number 53
day of year 1
day of week 4
day of month 2
week number 5
day of year 33
day of week 2
day of month 3
week number 9
day of year 63
day of week 5
day of month 4
week number 14
day of year 94
day of week 3
day of month 5
week number 19
day of year 125
day of week 0
day of month 6
week number 23
day of year 157
day of week 5

In [27]:
import numpy as np
def distance(v1, v2):
    return np.sqrt(np.sum((v1 - v2) ** 2)) 

s1=pd.Series([1,2,3,4,5,6,7,8,9,10])
s2=pd.Series([10,9,8,7,6,5,4,3,2,1])
dis = distance(s1,s2)

dis

18.16590212458495

In [39]:
date = pd.date_range('2000-01-01', periods=10, freq='W-SUN')
print(date)
date = pd.date_range('2000-01-01', periods=10, freq='W-SAT')
print(date)

DatetimeIndex(['2000-01-02', '2000-01-09', '2000-01-16', '2000-01-23',
               '2000-01-30', '2000-02-06', '2000-02-13', '2000-02-20',
               '2000-02-27', '2000-03-05'],
              dtype='datetime64[ns]', freq='W-SUN')
DatetimeIndex(['2000-01-01', '2000-01-08', '2000-01-15', '2000-01-22',
               '2000-01-29', '2000-02-05', '2000-02-12', '2000-02-19',
               '2000-02-26', '2000-03-04'],
              dtype='datetime64[ns]', freq='W-SAT')

In [46]:
df = pd.read_csv('../boston_house_price.csv', chunksize=50)
df2 = pd.DataFrame()
for chunk in df:
    df2 = df2.append(chunk.iloc[0,:])

In [47]:
df2

,AGE,B,CHAS,CRIM,DIS,INDUS,LSTAT,MEDV,NOX,PTRATIO,RAD,RM,TAX,ZN
0,65.2,396.90,0.0,0.00632,4.0900,2.31,4.98,24.0,0.538,15.3,1.0,6.575,296.0,18.0
50,45.7,395.56,0.0,0.08873,6.8147,5.64,13.45,19.7,0.439,16.8,4.0,5.963,243.0,21.0
100,79.9,394.76,0.0,0.14866,2.7778,8.56,9.42,27.5,0.520,20.9,5.0,6.727,384.0,0.0
150,97.3,372.80,0.0,1.65660,1.6180,19.58,14.10,21.5,0.871,14.7,5.0,6.122,403.0,0.0
200,13.9,384.30,0.0,0.01778,7.6534,1.47,4.45,32.9,0.403,17.0,3.0,7.135,402.0,95.0
250,13.0,396.28,0.0,0.14030,7.3967,5.86,5.90,24.4,0.431,19.1,7.0,6.487,330.0,22.0
300,47.4,390.86,0.0,0.04417,7.8278,2.24,6.07,24.8,0.400,14.8,5.0,6.871,358.0,70.0
350,44.4,396.90,0.0,0.06211,8.7921,1.25,5.98,22.9,0.429,19.7,1.0,6.490,335.0,40.0
400,100.0,396.90,0.0,25.04610,1.5888,18.10,26.77,5.6,0.693,20.2,24.0,5.987,666.0,0.0
450,92.6,0.32,0.0,6.71772,2.3236,18.10,17.44,13.4,0.713,20.2,24.0,6.749,666.0,0.0
500,79.7,396.90,0.0,0.22438,2.4982,9.69,14.33,16.8,0.585,19.2,6.0,6.027,391.0,0.0